Revit 2026 API

# DisplacementElementCanElementsBeDisplaced(View, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanElementsBeDisplaced(
	View view,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function CanElementsBeDisplaced (
	view As View,
	elementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool CanElementsBeDisplaced(
	View^ view,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member CanElementsBeDisplaced :
        view : View *
        elementIds : ICollection<ElementId> -> bool
```

#### Parameters

view View

elementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

DisplacementElement Class

CanElementsBeDisplaced Overload

Autodesk.Revit.DB Namespace